wavvar/mmwk/sdk/examples/presence/sdkconfig.defaults.wdr
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
# CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP is not set
# CONFIG_MQTT_OUTBOX_DATA_ON_EXTERNAL_MEMORY is not set
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_RADAR_BOARD_WDR=y
# CONFIG_RADAR_BOARD_AUDIO_ENABLED is not set
# WDR shares the console/control path on UART by default in this SDK example.
# Keep INFO logs off that path so CLI JSON responses remain parseable.
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
CONFIG_LOG_DEFAULT_LEVEL=2
CONFIG_LOG_MAXIMUM_LEVEL=2
